7767517
15 15
Input            data                     0 1 data
Convolution      conv0_fwd                1 1 data conv0_fwd 0=6 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=150
Sigmoid          conv0_sigmoid_fwd        1 1 conv0_fwd conv0_sigmoid_fwd
Pooling          pool0_fwd                1 1 conv0_sigmoid_fwd pool0_fwd 0=1 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      conv1_fwd                1 1 pool0_fwd conv1_fwd 0=16 1=5 11=5 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2400
Sigmoid          conv1_sigmoid_fwd        1 1 conv1_fwd conv1_sigmoid_fwd
Pooling          pool1_fwd                1 1 conv1_sigmoid_fwd pool1_fwd 0=1 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1 6=0
Flatten          flatten_13               1 1 pool1_fwd flatten_13
InnerProduct     dense0_fwd               1 1 flatten_13 dense0_fwd 0=120 1=1 2=48000
Sigmoid          dense0_sigmoid_fwd       1 1 dense0_fwd dense0_sigmoid_fwd
Flatten          flatten_17               1 1 dense0_sigmoid_fwd flatten_17
InnerProduct     dense1_fwd               1 1 flatten_17 dense1_fwd 0=84 1=1 2=10080
Sigmoid          dense1_sigmoid_fwd       1 1 dense1_fwd dense1_sigmoid_fwd
Flatten          flatten_21               1 1 dense1_sigmoid_fwd flatten_21
InnerProduct     dense2_fwd               1 1 flatten_21 dense2_fwd 0=10 1=1 2=840
